zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/Wireless/KW/KW43L43Z97/KW43L43Z97_COMMON.h
/* ITRC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral ITRC_0 base address */
  #define ITRC_0_BASE                              (0x50016000u)
  /** Peripheral ITRC_0 base address */
  #define ITRC_0_BASE_NS                           (0x40016000u)
  /** Peripheral ITRC_0 base pointer */
  #define ITRC_0                                   ((ITRC_Type *)ITRC_0_BASE)
  /** Peripheral ITRC_0 base pointer */
  #define ITRC_0_NS                                ((ITRC_Type *)ITRC_0_BASE_NS)
  /** Array initializer of ITRC peripheral base addresses */
  #define ITRC_BASE_ADDRS                          { ITRC_0_BASE }
  /** Array initializer of ITRC peripheral base pointers */
  #define ITRC_BASE_PTRS                           { ITRC_0 }
  /** Array initializer of ITRC peripheral base addresses */
  #define ITRC_BASE_ADDRS_NS                       { ITRC_0_BASE_NS }
  /** Array initializer of ITRC peripheral base pointers */
  #define ITRC_BASE_PTRS_NS                        { ITRC_0_NS }
#else
  /** Peripheral ITRC_0 base address */
  #define ITRC_0_BASE                              (0x40016000u)
  /** Peripheral ITRC_0 base pointer */
  #define ITRC_0                                   ((ITRC_Type *)ITRC_0_BASE)
  /** Array initializer of ITRC peripheral base addresses */
  #define ITRC_BASE_ADDRS                          { ITRC_0_BASE }
  /** Array initializer of ITRC peripheral base pointers */
  #define ITRC_BASE_PTRS                           { ITRC_0 }
#endif

/* LPCMP - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral CMP_0 base address */
  #define CMP_0_BASE                               (0x50030000u)
  /** Peripheral CMP_0 base address */
  #define CMP_0_BASE_NS                            (0x40030000u)
  /** Peripheral CMP_0 base pointer */
  #define CMP_0                                    ((LPCMP_Type *)CMP_0_BASE)
  /** Peripheral CMP_0 base pointer */
  #define CMP_0_NS                                 ((LPCMP_Type *)CMP_0_BASE_NS)
  /** Array initializer of LPCMP peripheral base addresses */
  #define LPCMP_BASE_ADDRS                         { CMP_0_BASE }
  /** Array initializer of LPCMP peripheral base pointers */
  #define LPCMP_BASE_PTRS                          { CMP_0 }
  /** Array initializer of LPCMP peripheral base addresses */
  #define LPCMP_BASE_ADDRS_NS                      { CMP_0_BASE_NS }
  /** Array initializer of LPCMP peripheral base pointers */
  #define LPCMP_BASE_PTRS_NS                       { CMP_0_NS }
#else
  /** Peripheral CMP_0 base address */
  #define CMP_0_BASE                               (0x40030000u)
  /** Peripheral CMP_0 base pointer */
  #define CMP_0                                    ((LPCMP_Type *)CMP_0_BASE)
  /** Array initializer of LPCMP peripheral base addresses */
  #define LPCMP_BASE_ADDRS                         { CMP_0_BASE }
  /** Array initializer of LPCMP peripheral base pointers */
  #define LPCMP_BASE_PTRS                          { CMP_0 }
#endif

/* LPI2C - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPI2C_0 base address */
  #define LPI2C_0_BASE                             (0x501A0000u)
  /** Peripheral LPI2C_0 base address */
  #define LPI2C_0_BASE_NS                          (0x401A0000u)
  /** Peripheral LPI2C_0 base pointer */
  #define LPI2C_0                                  ((LPI2C_Type *)LPI2C_0_BASE)
  /** Peripheral LPI2C_0 base pointer */
  #define LPI2C_0_NS                               ((LPI2C_Type *)LPI2C_0_BASE_NS)
  /** Peripheral LPI2C_1 base address */
  #define LPI2C_1_BASE                             (0x5002C000u)
  /** Peripheral LPI2C_1 base address */
  #define LPI2C_1_BASE_NS                          (0x4002C000u)
  /** Peripheral LPI2C_1 base pointer */
  #define LPI2C_1                                  ((LPI2C_Type *)LPI2C_1_BASE)
  /** Peripheral LPI2C_1 base pointer */
  #define LPI2C_1_NS                               ((LPI2C_Type *)LPI2C_1_BASE_NS)
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS                         { LPI2C_0_BASE, LPI2C_1_BASE }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS                          { LPI2C_0, LPI2C_1 }
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS_NS                      { LPI2C_0_BASE_NS, LPI2C_1_BASE_NS }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS_NS                       { LPI2C_0_NS, LPI2C_1_NS }
#else
  /** Peripheral LPI2C_0 base address */
  #define LPI2C_0_BASE                             (0x401A0000u)
  /** Peripheral LPI2C_0 base pointer */
  #define LPI2C_0                                  ((LPI2C_Type *)LPI2C_0_BASE)
  /** Peripheral LPI2C_1 base address */
  #define LPI2C_1_BASE                             (0x4002C000u)
  /** Peripheral LPI2C_1 base pointer */
  #define LPI2C_1                                  ((LPI2C_Type *)LPI2C_1_BASE)
  /** Array initializer of LPI2C peripheral base addresses */
  #define LPI2C_BASE_ADDRS                         { LPI2C_0_BASE, LPI2C_1_BASE }
  /** Array initializer of LPI2C peripheral base pointers */
  #define LPI2C_BASE_PTRS                          { LPI2C_0, LPI2C_1 }
#endif
/** Interrupt vectors for the LPI2C peripheral type */
#define LPI2C_IRQS                               { LPI2C0_IRQn, LPI2C1_IRQn }

/* LPIT - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPIT_0 base address */
  #define LPIT_0_BASE                              (0x5001D000u)
  /** Peripheral LPIT_0 base address */
  #define LPIT_0_BASE_NS                           (0x4001D000u)
  /** Peripheral LPIT_0 base pointer */
  #define LPIT_0                                   ((LPIT_Type *)LPIT_0_BASE)
  /** Peripheral LPIT_0 base pointer */
  #define LPIT_0_NS                                ((LPIT_Type *)LPIT_0_BASE_NS)
  /** Array initializer of LPIT peripheral base addresses */
  #define LPIT_BASE_ADDRS                          { LPIT_0_BASE }
  /** Array initializer of LPIT peripheral base pointers */
  #define LPIT_BASE_PTRS                           { LPIT_0 }
  /** Array initializer of LPIT peripheral base addresses */
  #define LPIT_BASE_ADDRS_NS                       { LPIT_0_BASE_NS }
  /** Array initializer of LPIT peripheral base pointers */
  #define LPIT_BASE_PTRS_NS                        { LPIT_0_NS }
#else
  /** Peripheral LPIT_0 base address */
  #define LPIT_0_BASE                              (0x4001D000u)
  /** Peripheral LPIT_0 base pointer */
  #define LPIT_0                                   ((LPIT_Type *)LPIT_0_BASE)
  /** Array initializer of LPIT peripheral base addresses */
  #define LPIT_BASE_ADDRS                          { LPIT_0_BASE }
  /** Array initializer of LPIT peripheral base pointers */
  #define LPIT_BASE_PTRS                           { LPIT_0 }
#endif
/** Interrupt vectors for the LPIT peripheral type */
#define LPIT_IRQS                                { { LPIT0_IRQn, LPIT0_IRQn, LPIT0_IRQn, LPIT0_IRQn } }

/* LPSPI - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPSPI_0 base address */
  #define LPSPI_0_BASE                             (0x50183000u)
  /** Peripheral LPSPI_0 base address */
  #define LPSPI_0_BASE_NS                          (0x40183000u)
  /** Peripheral LPSPI_0 base pointer */
  #define LPSPI_0                                  ((LPSPI_Type *)LPSPI_0_BASE)
  /** Peripheral LPSPI_0 base pointer */
  #define LPSPI_0_NS                               ((LPSPI_Type *)LPSPI_0_BASE_NS)
  /** Peripheral LPSPI_1 base address */
  #define LPSPI_1_BASE                             (0x50025000u)
  /** Peripheral LPSPI_1 base address */
  #define LPSPI_1_BASE_NS                          (0x40025000u)
  /** Peripheral LPSPI_1 base pointer */
  #define LPSPI_1                                  ((LPSPI_Type *)LPSPI_1_BASE)
  /** Peripheral LPSPI_1 base pointer */
  #define LPSPI_1_NS                               ((LPSPI_Type *)LPSPI_1_BASE_NS)
  /** Peripheral LPSPI_2 base address */
  #define LPSPI_2_BASE                             (0x50026000u)
  /** Peripheral LPSPI_2 base address */
  #define LPSPI_2_BASE_NS                          (0x40026000u)
  /** Peripheral LPSPI_2 base pointer */
  #define LPSPI_2                                  ((LPSPI_Type *)LPSPI_2_BASE)
  /** Peripheral LPSPI_2 base pointer */
  #define LPSPI_2_NS                               ((LPSPI_Type *)LPSPI_2_BASE_NS)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { LPSPI_0_BASE, LPSPI_1_BASE, LPSPI_2_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { LPSPI_0, LPSPI_1, LPSPI_2 }
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS_NS                      { LPSPI_0_BASE_NS, LPSPI_1_BASE_NS, LPSPI_2_BASE_NS }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS_NS                       { LPSPI_0_NS, LPSPI_1_NS, LPSPI_2_NS }
#else
  /** Peripheral LPSPI_0 base address */
  #define LPSPI_0_BASE                             (0x40183000u)
  /** Peripheral LPSPI_0 base pointer */
  #define LPSPI_0                                  ((LPSPI_Type *)LPSPI_0_BASE)
  /** Peripheral LPSPI_1 base address */
  #define LPSPI_1_BASE                             (0x40025000u)
  /** Peripheral LPSPI_1 base pointer */
  #define LPSPI_1                                  ((LPSPI_Type *)LPSPI_1_BASE)
  /** Peripheral LPSPI_2 base address */
  #define LPSPI_2_BASE                             (0x40026000u)
  /** Peripheral LPSPI_2 base pointer */
  #define LPSPI_2                                  ((LPSPI_Type *)LPSPI_2_BASE)
  /** Array initializer of LPSPI peripheral base addresses */
  #define LPSPI_BASE_ADDRS                         { LPSPI_0_BASE, LPSPI_1_BASE, LPSPI_2_BASE }
  /** Array initializer of LPSPI peripheral base pointers */
  #define LPSPI_BASE_PTRS                          { LPSPI_0, LPSPI_1, LPSPI_2 }
#endif
/** Interrupt vectors for the LPSPI peripheral type */
#define LPSPI_IRQS                               { LPSPI0_IRQn, LPSPI1_IRQn, LPSPI2_IRQn }

/* LPTMR - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPTMR_0 base address */
  #define LPTMR_0_BASE                             (0x50185000u)
  /** Peripheral LPTMR_0 base address */
  #define LPTMR_0_BASE_NS                          (0x40185000u)
  /** Peripheral LPTMR_0 base pointer */
  #define LPTMR_0                                  ((LPTMR_Type *)LPTMR_0_BASE)
  /** Peripheral LPTMR_0 base pointer */
  #define LPTMR_0_NS                               ((LPTMR_Type *)LPTMR_0_BASE_NS)
  /** Peripheral LPTMR_1 base address */
  #define LPTMR_1_BASE                             (0x50186000u)
  /** Peripheral LPTMR_1 base address */
  #define LPTMR_1_BASE_NS                          (0x40186000u)
  /** Peripheral LPTMR_1 base pointer */
  #define LPTMR_1                                  ((LPTMR_Type *)LPTMR_1_BASE)
  /** Peripheral LPTMR_1 base pointer */
  #define LPTMR_1_NS                               ((LPTMR_Type *)LPTMR_1_BASE_NS)
  /** Array initializer of LPTMR peripheral base addresses */
  #define LPTMR_BASE_ADDRS                         { LPTMR_0_BASE, LPTMR_1_BASE }
  /** Array initializer of LPTMR peripheral base pointers */
  #define LPTMR_BASE_PTRS                          { LPTMR_0, LPTMR_1 }
  /** Array initializer of LPTMR peripheral base addresses */
  #define LPTMR_BASE_ADDRS_NS                      { LPTMR_0_BASE_NS, LPTMR_1_BASE_NS }
  /** Array initializer of LPTMR peripheral base pointers */
  #define LPTMR_BASE_PTRS_NS                       { LPTMR_0_NS, LPTMR_1_NS }
#else
  /** Peripheral LPTMR_0 base address */
  #define LPTMR_0_BASE                             (0x40185000u)
  /** Peripheral LPTMR_0 base pointer */
  #define LPTMR_0                                  ((LPTMR_Type *)LPTMR_0_BASE)
  /** Peripheral LPTMR_1 base address */
  #define LPTMR_1_BASE                             (0x40186000u)
  /** Peripheral LPTMR_1 base pointer */
  #define LPTMR_1                                  ((LPTMR_Type *)LPTMR_1_BASE)
  /** Array initializer of LPTMR peripheral base addresses */
  #define LPTMR_BASE_ADDRS                         { LPTMR_0_BASE, LPTMR_1_BASE }
  /** Array initializer of LPTMR peripheral base pointers */
  #define LPTMR_BASE_PTRS                          { LPTMR_0, LPTMR_1 }
#endif
/** Interrupt vectors for the LPTMR peripheral type */
#define LPTMR_IRQS                               { LPTMR0_IRQn, LPTMR1_IRQn }

/* LPUART - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LPUART_0 base address */
  #define LPUART_0_BASE                            (0x50184000u)
  /** Peripheral LPUART_0 base address */
  #define LPUART_0_BASE_NS                         (0x40184000u)
  /** Peripheral LPUART_0 base pointer */
  #define LPUART_0                                 ((LPUART_Type *)LPUART_0_BASE)
  /** Peripheral LPUART_0 base pointer */
  #define LPUART_0_NS                              ((LPUART_Type *)LPUART_0_BASE_NS)
  /** Peripheral LPUART_1 base address */
  #define LPUART_1_BASE                            (0x50027000u)
  /** Peripheral LPUART_1 base address */
  #define LPUART_1_BASE_NS                         (0x40027000u)
  /** Peripheral LPUART_1 base pointer */
  #define LPUART_1                                 ((LPUART_Type *)LPUART_1_BASE)
  /** Peripheral LPUART_1 base pointer */
  #define LPUART_1_NS                              ((LPUART_Type *)LPUART_1_BASE_NS)
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS                        { LPUART_0_BASE, LPUART_1_BASE }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS                         { LPUART_0, LPUART_1 }
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS_NS                     { LPUART_0_BASE_NS, LPUART_1_BASE_NS }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS_NS                      { LPUART_0_NS, LPUART_1_NS }
#else
  /** Peripheral LPUART_0 base address */
  #define LPUART_0_BASE                            (0x40184000u)
  /** Peripheral LPUART_0 base pointer */
  #define LPUART_0                                 ((LPUART_Type *)LPUART_0_BASE)
  /** Peripheral LPUART_1 base address */
  #define LPUART_1_BASE                            (0x40027000u)
  /** Peripheral LPUART_1 base pointer */
  #define LPUART_1                                 ((LPUART_Type *)LPUART_1_BASE)
  /** Array initializer of LPUART peripheral base addresses */
  #define LPUART_BASE_ADDRS                        { LPUART_0_BASE, LPUART_1_BASE }
  /** Array initializer of LPUART peripheral base pointers */
  #define LPUART_BASE_PTRS                         { LPUART_0, LPUART_1 }
#endif
/** Interrupt vectors for the LPUART peripheral type */
#define LPUART_RX_TX_IRQS                        { LPUART0_IRQn, LPUART1_IRQn }
#define LPUART_ERR_IRQS                          { LPUART0_IRQn, LPUART1_IRQn }

/* LTC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral LTC base address */
  #define LTC_BASE                                 (0x50106800u)
  /** Peripheral LTC base address */
  #define LTC_BASE_NS                              (0x40106800u)
  /** Peripheral LTC base pointer */
  #define LTC                                      ((LTC_Type *)LTC_BASE)
  /** Peripheral LTC base pointer */
  #define LTC_NS                                   ((LTC_Type *)LTC_BASE_NS)
  /** Array initializer of LTC peripheral base addresses */
  #define LTC_BASE_ADDRS                           { LTC_BASE }
  /** Array initializer of LTC peripheral base pointers */
  #define LTC_BASE_PTRS                            { LTC }
  /** Array initializer of LTC peripheral base addresses */
  #define LTC_BASE_ADDRS_NS                        { LTC_BASE_NS }
  /** Array initializer of LTC peripheral base pointers */
  #define LTC_BASE_PTRS_NS                         { LTC_NS }
#else
  /** Peripheral LTC base address */
  #define LTC_BASE                                 (0x40106800u)
  /** Peripheral LTC base pointer */
  #define LTC                                      ((LTC_Type *)LTC_BASE)
  /** Array initializer of LTC peripheral base addresses */
  #define LTC_BASE_ADDRS                           { LTC_BASE }
  /** Array initializer of LTC peripheral base pointers */
  #define LTC_BASE_PTRS                            { LTC }
#endif

/* MCM - Peripheral instance base addresses */
/** Peripheral PPB_MCM2_CM4 base address */
#define PPB_MCM2_CM4_BASE                        (0xE0080000u)
/** Peripheral PPB_MCM2_CM4 base pointer */
#define PPB_MCM2_CM4                             ((MCM_Type *)PPB_MCM2_CM4_BASE)
/** Array initializer of MCM peripheral base addresses */
#define MCM_BASE_ADDRS                           { PPB_MCM2_CM4_BASE }
/** Array initializer of MCM peripheral base pointers */
#define MCM_BASE_PTRS                            { PPB_MCM2_CM4 }

/* MRCC - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MRCC_0 base address */
  #define MRCC_0_BASE                              (0x501A1000u)
  /** Peripheral MRCC_0 base address */
  #define MRCC_0_BASE_NS                           (0x401A1000u)
  /** Peripheral MRCC_0 base pointer */
  #define MRCC_0                                   ((MRCC_Type *)MRCC_0_BASE)
  /** Peripheral MRCC_0 base pointer */
  #define MRCC_0_NS                                ((MRCC_Type *)MRCC_0_BASE_NS)
  /** Array initializer of MRCC peripheral base addresses */
  #define MRCC_BASE_ADDRS                          { MRCC_0_BASE }
  /** Array initializer of MRCC peripheral base pointers */
  #define MRCC_BASE_PTRS                           { MRCC_0 }
  /** Array initializer of MRCC peripheral base addresses */
  #define MRCC_BASE_ADDRS_NS                       { MRCC_0_BASE_NS }
  /** Array initializer of MRCC peripheral base pointers */
  #define MRCC_BASE_PTRS_NS                        { MRCC_0_NS }
#else
  /** Peripheral MRCC_0 base address */
  #define MRCC_0_BASE                              (0x401A1000u)
  /** Peripheral MRCC_0 base pointer */
  #define MRCC_0                                   ((MRCC_Type *)MRCC_0_BASE)
  /** Array initializer of MRCC peripheral base addresses */
  #define MRCC_BASE_ADDRS                          { MRCC_0_BASE }
  /** Array initializer of MRCC peripheral base pointers */
  #define MRCC_BASE_PTRS                           { MRCC_0 }
#endif

/* MSCM - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral MSCM base address */
  #define MSCM_BASE                                (0x50012000u)
  /** Peripheral MSCM base address */
  #define MSCM_BASE_NS                             (0x40012000u)
  /** Peripheral MSCM base pointer */
  #define MSCM                                     ((MSCM_Type *)MSCM_BASE)
  /** Peripheral MSCM base pointer */
  #define MSCM_NS                                  ((MSCM_Type *)MSCM_BASE_NS)
  /** Array initializer of MSCM peripheral base addresses */
  #define MSCM_BASE_ADDRS                          { MSCM_BASE }
  /** Array initializer of MSCM peripheral base pointers */
  #define MSCM_BASE_PTRS                           { MSCM }
  /** Array initializer of MSCM peripheral base addresses */
  #define MSCM_BASE_ADDRS_NS                       { MSCM_BASE_NS }
  /** Array initializer of MSCM peripheral base pointers */
  #define MSCM_BASE_PTRS_NS                        { MSCM_NS }
#else
  /** Peripheral MSCM base address */
  #define MSCM_BASE                                (0x40012000u)
  /** Peripheral MSCM base pointer */
  #define MSCM                                     ((MSCM_Type *)MSCM_BASE)
  /** Array initializer of MSCM peripheral base addresses */
  #define MSCM_BASE_ADDRS                          { MSCM_BASE }
  /** Array initializer of MSCM peripheral base pointers */
  #define MSCM_BASE_PTRS                           { MSCM }
#endif

